app/controllers/home_controller.rb

SELECT * FROM "posts" WHERE ("posts"."post_type" = 'home') ORDER BY created_at LIMIT 1
---
  def index
    @posts = Post.all(:conditions => ["post_type = ?","home"], :order => "created_at DESC")