app/controllers/home_controller.rb

  def index
    @posts = Post.all
    @files = Nspirefile.all
---
SELECT * FROM "posts" WHERE ("posts"."type" = 'home') ORDER BY created_at LIMIT 1
SELECT * FROM "nspirefiles"