app/controllers/nspire_controller.rb

SELECT * FROM "nspirefiles" WHERE (title LIKE '%andrew%' OR author LIKE '%andrew%' OR category LIKE '%andrew%' OR description LIKE '%andrew%') ORDER BY updated_at DESC
---
  def index
    @nspirefiles = params[:search_term].nil? ? Nspirefile.all(:order => "updated_at DESC") : search(params[:search_term])

SELECT * FROM "nspirefiles" WHERE (title LIKE 'nelson' OR author LIKE 'nelson' OR category LIKE 'nelson' OR description LIKE 'nelson')
---
  def search(search_term)
     queryterm = "%" + search_term + "%"
     return Nspirefile.all(:order => "updated_at DESC",:conditions => ["title LIKE ? OR author LIKE ? OR category LIKE ? OR description LIKE ?", queryterm, queryterm, queryterm, queryterm])