app/controllers/nspirefiles_controller.rb

  def index
    @nspirefiles = Nspirefile.all(:order => "updated_at DESC")
---
SELECT * FROM "nspirefiles" ORDER BY updated_at DESC

  def show
    @nspirefile = Nspirefile.find(params[:id])
---
SELECT * FROM "nspirefiles" WHERE ("nspirefiles"."id" = 0)

  def edit
    @nspirefile = Nspirefile.find(params[:id])
---
SELECT * FROM "nspirefiles" WHERE ("nspirefiles"."id" = 2)

  def create
    @nspirefile = Nspirefile.new(params[:nspirefile])

    respond_to do |format|
      if @nspirefile.save
---
INSERT INTO "nspirefiles" ("category", "created_at", "title", "author", "image_url", "file_url", "updated_at", "description") VALUES('Family', '2009-08-28 18:56:57', 'Dad''s File', 'Ross', 'none', 'none', '2009-08-28 18:56:57', 'This is a sample File!!!')

  def update
    @nspirefile = Nspirefile.find(params[:id])
    @categories = get_categories
    respond_to do |format|
      if @nspirefile.update_attributes(params[:nspirefile])
---
SELECT * FROM "nspirefiles" WHERE ("nspirefiles"."id" = 2)
UPDATE "nspirefiles" SET "updated_at" = '2009-08-30 03:06:20', "file_url" = 'none :)', "category" = 'test', "author" = 'Ross', "title" = 'Test File', "description" = 'This is a test file used to test out new features!' WHERE "id" = 2

  def destroy
    @nspirefile = Nspirefile.find(params[:id])
    @nspirefile.destroy
---
SELECT * FROM "nspirefiles" WHERE ("nspirefiles"."id" = 1)
DELETE FROM "nspirefiles" WHERE "id" = 1