app/controllers/posts_controller.rb

  def index
    @posts = Post.find(:all, :conditions => ["post_type = ?", "home"] ,:order => "created_at DESC")
---
SELECT * FROM "posts" WHERE (post_type = 'home') ORDER BY created_at DESC