app/controllers/tutorials_controller.rb

  def index
    @tutorials = Post.find(:all, :conditions => ["post_type = :posttype",{:posttype => "tutorial"}], :order => "created_at DESC")
---
SELECT * FROM "posts" WHERE (post_type = 'tutorial') ORDER BY created_at DESC

  def view
    @tutorial = Post.find(params[:id], :conditions => ["post_type = :posttype",{:posttype => "tutorial"}], :order => "created_at DESC")
---
SELECT * FROM "posts" WHERE ("posts"."id" = 5 AND (post_type = 'tutorial')) ORDER BY created_at DESC