app/controllers/upload_controller.rb

  def save
    @download = Download.new(params[:file])
    if @download.save
---
INSERT INTO "downloads" ("name", "data", "content_type") VALUES(NULL, NULL, NULL)

  def download
    @download = Download.find(params[:id])
---
SELECT * FROM "downloads" WHERE ("downloads"."id" = 4)